<a href="https://colab.research.google.com/github/theysee/sberbank_reboot/blob/master/Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Тест

In [0]:
#https://docs.google.com/forms/d/164DJQWX4jTVtjK88ukydzT69KQO-h-YPoicVyFEU0y8/alreadyresponded?edit_requested=true

In [1]:
!pip install PyMySQL

Collecting PyMySQL
  Downloading https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 2.6MB/s
Installing collected packages: PyMySQL
Successfully installed PyMySQL-0.9.3

In [0]:
import pymysql
import numpy as np
import pandas as pd

DB_HOST = '89.223.95.235'
DB_USER = 'student_12'
DB_USER_PASSWORD = 'student_12'
DB_NAME = 'student_12'

In [78]:
conn = pymysql.connect(DB_HOST, DB_USER, DB_USER_PASSWORD, DB_NAME)
pd.read_sql_query("show tables", conn)

  Tables_in_student_12
0              annonce
1               events

In [0]:
# напишите запрос для создания таблицы с объявлениями
query = """
  CREATE TABLE IF NOT EXISTS Users (
    id INT PRIMARY KEY,
    Name VARCHAR(50),
    Surname VARCHAR(50),
    Occupation VARCHAR(50)
  )
"""

conn.cursor().execute(query)
conn.commit()

In [0]:
query = "DROP TABLE IF EXISTS users"
conn.cursor().execute(query)
conn.commit()

In [0]:
query = """DELETE FROM users"""
conn.cursor().execute(query)
conn.commit()

In [0]:
queries = []


querie = '''INSERT INTO users VALUES ('0', 'jack', 'newton', 'businessman')'''
queries.append(querie)

for q in queries:
  conn.cursor().execute(q)
conn.commit()

In [100]:
pd.read_sql_query('''
SELECT * from Users

''', conn)

   id  Name Surname   Occupation
0   0  jack  newton  businessman

In [0]:
pd.read_sql_query('''

INSERT INTO users VALUES ('0', 'jack', 'newton', 'businessman')

''', conn)